## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_role_assignment.remote_tfstate_sp will be created
  + resource "azurerm_role_assignment" "remote_tfstate_sp" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cb541d69-43e9-403f-83bb-ba04327a5aaf"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/c6f0ed16-c14a-496d-9781-a8734d31261c/resourceGroups/tfstate/providers/Microsoft.Storage/storageAccounts/tfstate54qza"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>